ensemble-learning/test_cases/pehills/inputs/foam_base/0.orig/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
3000
(
(0.219939 0.00206555 -3.80969e-22)
(0.195291 -0.0109619 -1.72971e-20)
(0.147314 -0.0258579 0)
(-0.00958043 -0.00516181 1.4727e-18)
(-0.105092 0.0415615 -1.00385e-17)
(-0.0953182 0.0545142 -1.53196e-21)
(-0.0643767 0.0432319 -1.86858e-17)
(-0.0453051 0.0325922 -1.17094e-20)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
