ensemble-learning/test_cases/pehills/inputs/foam_base/0.orig/omega.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
3000
(
202.31
202.037
207.046
227.913
257.53
274.721
277.005
267.182
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        blended         1;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
100
(
201.187
200.729
198.432
193.207
185.4
176.386
167.226
158.429
...
)
;
    }
    bottomWall
    {
        blended         1;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
100
(
202.31
202.037
207.046
227.913
257.53
274.721
277.005
267.182
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
