ensemble-learning/test_cases/pehills/inputs/foam_base/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets;
libs ("libsampling.so");

setFormat raw;
surfaceFormat vtk;
interpolationScheme cellPoint;

fields
(
    U
    nut
);

sets
(
    line_x0
    {
        type        midPoint;
        axis        y;
        start       (0.0 0.0 0.05);
        end         (0.0 3.036 0.05);
    }
    line_x1
    {
        type        midPoint;
        axis        y;
        start       (1.0 -1 0.05);
        end         (1.0 3.036 0.05);
    }
    line_x2
    {
        type        midPoint;
        axis        y;
        start       (2.0 0.0 0.05);
        end         (2.0 3.036 0.05);
    }
    line_x3
    {
        type        midPoint;
        axis        y;
        start       (3.0 0.0 0.05);
        end         (3.0 3.036 0.05);
    }
    line_x4
    {
        type        midPoint;
        axis        y;
        start       (4.0 0.0 0.05);
        end         (4.0 3.036 0.05);
    }
    line_x4p5
    {
        type        midPoint;
        axis        y;
        start       (4.5 0.0 0.05);
        end         (4.5 3.036 0.05);
    }
    line_x5
    {
        type        midPoint;
        axis        y;
        start       (5.0 0.0 0.05);
        end         (5.0 3.036 0.05);
    }
    line_x6
    {
        type        midPoint;
        axis        y;
        start       (6.0 0.0 0.05);
        end         (6.0 3.036 0.05);
    }
    line_x7
    {
        type        midPoint;
        axis        y;
        start       (7.0 0.0 0.05);
        end         (7.0 3.036 0.05);
    }
    line_x8
    {
        type        midPoint;
        axis        y;
        start       (8.0 0.0 0.05);
        end         (8.0 3.036 0.05);
    }
);


surfaces
(

);

// *********************************************************************** //
